app/controllers/entities_controller.rb

  def index
    @entities = BaseEntity.all
---
SELECT * FROM `entities`

  def create
    owner = params[:entity].delete :owner_uuid
    @entity = BaseEntity.create!(params[:entity])
---
INSERT INTO `entities` (`created_at`, `title`, `updated_at`, `uuid`, `content`) VALUES('2009-11-13 04:11:49', 'blah', '2009-11-13 04:11:49', 'ddafdfaf-9971-405b-9185-da057f70c280', 'blow')